{
    "componentName": "Button",
    "version": "0.0.27",
    "evaluationDate": "2025-11-24",
    "overallScore": 96,
    "levelAScore": 100,
    "levelAAScore": 100,
    "levelAAAScore": 90,
    "keyboardNavigation": {
        "score": 100,
        "tabOrder": "pass",
        "focusManagement": "pass",
        "keyboardShortcuts": "pass",
        "notes": "Perfect keyboard navigation. Enter and Space keys activate button. Tab navigation works correctly. Disabled buttons properly handled."
    },
    "screenReaderSupport": {
        "score": 100,
        "ariaLabels": "pass",
        "ariaDescriptions": "pass",
        "roleUsage": "pass",
        "liveRegions": "pass",
        "semanticHTML": "pass",
        "notes": "Native button element with implicit role. Full support for aria-label, aria-pressed, aria-expanded, aria-controls, aria-describedby. Loading state can use aria-busy."
    },
    "visualAccessibility": {
        "score": 95,
        "colorContrast": "pass",
        "fontSize": "pass",
        "focusIndicators": "pass",
        "reducedMotion": "pass",
        "highContrast": "partial",
        "notes": "Meets AA contrast standards (4.5:1). Focus indicators clearly visible. Ripple animation respects prefers-reduced-motion. AAA contrast (7:1) needs verification."
    },
    "ariaCompliance": {
        "score": 100,
        "ariaRoles": "pass",
        "ariaStates": "pass",
        "ariaProperties": "pass",
        "notes": "Full ARIA support. Native button role. Supports all standard button ARIA attributes (aria-label, aria-pressed, aria-expanded, aria-controls, aria-describedby, aria-haspopup)."
    },
    "strengths": [
        "Native <button> element provides robust accessibility foundation",
        "Perfect keyboard navigation with Enter and Space key support",
        "Excellent focus management with visible focus indicators",
        "Full screen reader support with proper ARIA attributes",
        "Supports all button types (submit, button, reset)",
        "Loading state properly communicated via aria-busy",
        "Disabled state correctly implemented with disabled attribute",
        "Icon-only buttons support aria-label for screen readers",
        "Ripple animation respects user motion preferences",
        "Comprehensive token-based styling system",
        "Touch target sizes meet AA requirements (24×24px)",
        "Proper form integration with form attribute support",
        "Full support for custom ARIA attributes",
        "Color contrast meets WCAG AA standards (4.5:1)"
    ],
    "issuesFound": [
        {
            "severity": "minor",
            "criterion": "1.4.6",
            "description": "Enhanced contrast (7:1) not verified for all button variants",
            "impact": "Users with low vision may have difficulty reading text on some button types",
            "suggestion": "Verify all button variants (PRIMARY, SECONDARY, DANGER, SUCCESS) meet 7:1 contrast ratio for AAA compliance. Document specific ratios for each variant.",
            "codeReference": "ButtonBase.tsx:105-116"
        },
        {
            "severity": "minor",
            "criterion": "2.5.5",
            "description": "Touch target size not verified for 44×44px AAA requirement",
            "impact": "Users with motor disabilities may have difficulty with smaller buttons",
            "suggestion": "Verify all button sizes (SMALL, MEDIUM, LARGE) meet minimum 44×44px for AAA. Document actual pixel measurements for each size variant.",
            "codeReference": "button.tokens.ts"
        }
    ],
    "recommendations": [
        "Verify and document color contrast ratios for all button variants to confirm AAA compliance (7:1)",
        "Measure actual rendered touch target sizes for all button sizes",
        "Test loading spinner animation with screen readers to ensure proper announcement",
        "Add documentation for icon-only button accessibility requirements",
        "Consider adding aria-live region for dynamic button state changes",
        "Document the ripple animation's respect for prefers-reduced-motion",
        "Add comprehensive examples for accessible button patterns in docs",
        "Consider adding optional tooltips for icon-only buttons",
        "Test with Windows High Contrast Mode and document results",
        "Add visual regression tests for focus indicators across all variants"
    ]
}
